import simpsonsCharacterInterface from "../interfaces/simpsonCharacter.interface";

export const simpsonsCharacters: simpsonsCharacterInterface[] = [
  {
    id: 1,
    name: "Bart",
    surname: "Simpson",
    age: 10,
    info: `Барт Сімпсон - це фіктивний персонаж з популярного американського мультсеріалу "Сімпсони", створеного Меттом Ґроунінґом. Він є найстаршим сином Гомера та Мардж Сімпсонів, і має відповідальну репутацію злодюги та балагура в містечку Спрінгфілд. Барт - підліток з віковою групою 10-12 років, з відмінним почуттям гумору та непередбачуваними рішеннями, що викликають часті незгоди з дорослими. Його знамениті фрази "Я не зробив це" та "Працював не я" стали культовими, відображаючи його непокірну та некеровану натуру. Незважаючи на свої недоліки, Барт також проявляє велику прив'язаність до своєї родини, особливо до своєї молодшої сестри Лізи, з якою він має складні, але сильні відносини.`,
    photo: "https://upload.wikimedia.org/wikipedia/uk/a/aa/Bart_simpson.png",
  },
  {
    id: 2,
    name: "Homer",
    surname: "Simpson",
    age: 40,
    info: `Гомер Сімпсон - це фіктивний персонаж американського мультсеріалу "Сімпсони", створеного Меттом Гроунінгом. Він є головним героєм серіалу і головою родини Сімпсонів, яка складається з дружини Мардж, сина Барта, дочки Ліси та маленької Меґгі. Гомер - це типічний американський батько з середнього класу, зайнятий роботою на заводі як оператор ядерного реактора. Він відомий своєю низькою інтелектуальною рівні та нескладним способом життя, часто приймає рішення, які призводять до комічних ситуацій. Гомер є любителем їжі, пива та телевізора, і він не завжди виявляє відповідальність і розумність в різних життєвих ситуаціях. Він також має велике серце і відданість своїй родині, не дивлячись на свої недоліки. Гомер часто потрапляє в курйозні пригоди, де виявляється як людина з найгіршим можливим рішенням у критичні моменти. Втім, він завжди старається вирішувати проблеми власним неординарним способом, що додає гумору та розваги серіалу. Гомер Сімпсон - це культовий персонаж, який став символом американської культури, представляючи сміливу, але водночас недосконалу сторону багатьох батьків, чоловіків та американців загалом.`,
    photo:
      "http://upload.wikimedia.org/wikipedia/en/0/02/Homer_Simpson_2006.png",
  },
  {
    id: 3,
    name: "Marge",
    surname: "Simpson",
    age: 38,
    info: `Мардж Сімпсон - це одна з головних героїнь американського мультсеріалу "Сімпсони", створеного Меттом Ґроунінґом. Вона - дружина Гомера Сімпсона і мати трьох дітей - Барта, Ліси та Меггі. Мардж - символ домашнього комфорту та сімейного затишку, завжди доглядає за своєю родиною, піклується про дітей та підтримує свого чоловіка, хоча він часто потрапляє в різні комічні пригоди. Вона має високі моральні цінності та принципи, і важливий аспект її характеру - це її незрима сила, яка допомагає їй утримувати родину разом навіть в найскладніші моменти. Мардж є дуже відданою дружиною та матір'ю, і вона завжди старається знайти рішення для різних ситуацій, з якими зіштовхнеться її родина.`,
    photo: "https://upload.wikimedia.org/wikipedia/ru/0/0b/Marge_Simpson.png",
  },
  {
    id: 4,
    name: "Lisa",
    surname: "Simpson",
    age: 9,
    info: `Ліза Сімпсон - це героїня американського анімаційного серіалу "Сімпсони", створеного Меттом Ґроунінґом. Вона - десятирічна дочка головного героя Гомера Сімпсона та Мардж Сімпсон, і має двох братів, Барта та Меґґі. Ліза - розумна, талановита та принципова дівчинка зі складним характером та виразними переконаннями. Вона відома своїми соціальними поглядами, активним громадським ставленням та захистом прав тварин. Ліза - відмінна музикантка, вона вміє грати на саксофоні та володіє високим інтелектом. Вона також є сторонником екології, фемінізму та рівності. Ліза виступає в ряді епізодів серіалу як голос розуму в родині Сімпсонів, намагаючись протистояти вадам своїх рідних та висловлюючи свої переконання з великою силою. Ліза Сімпсон - це важливий символ самосвідомої, розумної та амбітної жінки, яка виступає за свої переконання та бореться за свої цінності.`,
    photo: "https://upload.wikimedia.org/wikipedia/ru/e/ec/Lisa_Simpson.png",
  },
  {
    id: 5,
    name: "Maggie",
    surname: "Simpson",
    age: 1,
    info: `Мегі Сімпсон - це молодша дочка родини Сімпсонів, знаменитої американської анімаційної серії "Сімпсони", створеної Меттом Грейнінгом. Мегі - немовля, яке має високий інтелект, але не може висловлювати свої думки словами, вона спілкується за допомогою свого знаменитого пустушок. Її зовнішність - це тоненька дівчинка з великими очима та синьо-жовтою дитячою сукнею, з якої вона ніколи не виходить. Мегі - це звичайна дитина звичайної американської родини, але вона виявляється вельми дотепною та винахідливою, часто врятувавши своїх батьків від різних неприємностей. Хоча Мегі ще дуже мала, вона вже стала одним із символів "Сімпсонів", впізнаваним багатьма людьми по всьому світу, завдяки своєму непересічному вигляду та особливому способу спілкування.`,
    photo: "https://upload.wikimedia.org/wikipedia/ru/9/9d/Maggie_Simpson.png",
  },
];
